# V Day1
# # 1. 直譯式語言 
#         - python 
#         - 可直接撰寫 , 執行 , 除錯 / 但執行週期較長
#      編譯式語言
#         - C / C++  
#         - 執行週期較短,  速度快 / 開發速度 , 除錯時間 較長
# # 2. 試爬蟲
#         - author / category / title 
# # 3. ~ print / input
#         - ref: 20200307
# 4. install Anaconda
#     - MAC     
#     - Windows

######################################################################## 

# V Day2 
# 1. 常用函式 print / input / type 
# 2. 註解 --> Ctrl + / 
# 3. 資料型別1 --> int / float (overflow) / complex / bool / None 
# 4. 資料型別2 --> str / index / + / * 
# 5. str 常用做法 --> 
#     1) .format 
#     2) [:]
#     3) .split 
#     4) .join 
#     5) .replace 
# 6. 運算子
#     1) 算數
#       - int *7 
#       - str *2
#     2) 關係: > < == != 
#     3) 邏輯: and / or / not 
#         # if a>20: print("嗨嗨")
#         # if A>20 or C == "KK": print("嗨嗨")
#         # if teacher != "Jeff": print("NoNoNo !!!")

########################################################################
# V Day3 
# 1. if-else / if-elif  / if-elif-else
# 2. list / index / append / pop 
# 3. dict / key-value / d[name]

########################################################################
# V Day4 
# 1. 回家試身手
# 2. list / dict again
# 3. 小試身手 #2 
# 4. in
# 5. dict in list 
# 6. for-loop 
# 7. 小試身手 #3 ~ 3-2

########################################################################
# V Day5
# 1. 小試身手 #3 ~ 3-2
# 2. while-loop
# 3. 大樂透
# 4. double for-loop
# 5. func #1 ~ #3

########################################################################
# V Day6
# 1. 回家身手 #3 ~ 3-2
# 2. 小試身手 #4
# 3. func #4 ~ #5 : local variable / get_passed_scores
# 4. 小試身手 #5 ~ 1 / 2
# 5. file


########################################################################
# V Day7
# 1. 小試身手 all
# 2. package
# 3. 網站 IT 基本認識 ~ 約 2 hr

########################################################################
# V Day8
# 1. nownews ~ 本文抓取

########################################################################
# V Day9
# 1. 解析頁面
# 2. 組合 function 
# 3. for-loop 取得更多
# 4. 資料落地
# 5. API 取得更多資料 ~ (差整理版)

########################################################################
# V Day10
# 1. API 取得資料 ~整理版
# 2. 大組合 function 
    # 首頁 -> 1 ~ 10 -> 更多到 49 -> 取得本文 -> 解析本文 -> 資料落地
# 3. 台彩 GOGOGO  ~ 取得隱藏參數 , 差 第一次 + 組合程式

########################################################################
# V Day11
# 1. 台彩 GOGOGO  ~ 取得隱藏參數 , 第一次 , 組合程式
# 2. ptt stock ~ 本文 ok
    # - 缺 解析 func 整理
    # - 資料落地
    # - 組合程式
    # - 轉成 .py 


########################################################################
# V Day12
# 1. ptt stock ~ 本文 ok
    # - 組合程式
    # - 資料落地
    # - 轉成 .py 
# 2. ptt with session 
# 3. others
    # - whole pic
    # - arrow

########################################################################
# V Day13 
# 1. 591 爬爬練習

########################################################################
# V Day14 
# 1. 591 爬爬 收尾
# 2. pandas 轉 excel
# 3. GCP 介紹
# 4. 爬蟲案例 介紹
# 5. 課程內容問卷 & 後測題目

